##
## brew
##
brew "coreutils"
brew "curl"
brew "gh"
brew "git"
brew "git-extras"
brew "gnupg"
brew "gnu-sed"
brew "grep"
brew "make"
brew "mise"
brew "neovim"
brew "starship"
brew "vim"
brew "webp"

# PHPに必要なもの
brew "autoconf"
brew "bison"
brew "re2c"
brew "pkg-config"
brew "libxml2"
brew "openssl@3"
brew "icu4c"
brew "zlib"
brew "libzip"
brew "oniguruma"
brew "freetype"
brew "jpeg"
brew "libpng"
brew "gmp"
brew "libsodium"
brew "readline"
brew "bzip2"


##
## cask
##
cask "1password"
cask "claude-code"
cask "deepl"
cask "discord"
cask "firefox"
cask "ghostty"
cask "google-chrome"
cask "notion"
cask "raycast"
cask "slack"
cask "visual-studio-code"

# font
cask "font-hack-nerd-font"

##
## mas
##
if OS.mac?  # macの時のみ実行
  mas "Skitch", id: 425955336
end
